Дана строка, состоящая только из круглых скобок, т.е. "(" и ")". Строка не пуста и не превосходит по длине $10^5$. Требуется проверить ее на правильность, т.е. могла ли она получиться из корректного арифметического выражения после удаления из него цифр и знаков операций [[Литература#^9783b9]]<c. 52>
```python
def f(input_: s) -> str:
    balance = 0

    for brac in input_:
        if brac == "(":
            balance += 1
        else:
            balance -= 1

    return "OK" if not balance else "BAD"

f("(()())()")  # 'OK'
```

Дана непустая строка длины до $10^5$, состоящая только из символов "(", ")", "[", "]". Требуется вывести "YES" или "NO" в зависимости от того, правильная это скобочная последовательность или нет [[Литература#^9783b9]]<c. 54>. 

Как и при решении предыдущей задачи, будем двигаться по строке слева направо и поддерживать состояние, описывающее незакрытые на данный момент скобки. Только теперь мы будем поддерживать не числовой баланс, а стек, содержащий символы, -- не закрытые пока скобки.

Когда текущий символ -- открывающая скобка, то будем добавлять ее в стек. Когда текущий символ -- закрывающая скобка, то будем проверять, на самом ли деле на вершине стека лежит соответствующая открывающая скобка. Если вместо этого там будет скобка другого типа либо же стек будет пустым, то скобочная последовательность некорректна. По завершении обработки строки останется только убедиться, что стек пуст
```python
def valid(s):
    stack = []
    for c in s:
        if c in ("(", "["):
            stack.append(c)
            continue
        if not stack:
            return False
        need = "(" if c == ")" else "["
        if stack.pop() != need:
            return False

    return not stack

s = input()
print("YES" if valid(s) else "NO")
```

Или можно просто воспользоваться двумя счетчикам -- у каждого типа скобки свой счетчик
```python
def f():
    balance_parenthesis = 0
    balance_square_bracket = 0

    for brac in input():
        if brac == "(":
            balance_parenthesis += 1
        elif brac == "[":
            balance_square_bracket += 1
        elif brac == ")":
            balance_parenthesis -= 1
        elif brac == "]":
            balance_square_bracket -= 1
        else:
            raise

    return (
        "YES" if (
            not balance_parenthesis and 
            not balance_square_bracket
        ) else "NO"
    )
```